Core/src/InformationRegisters/AzRyНапоминанияПользователя/AzRyНапоминанияПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AzRyНапоминанияПользователя</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособУстановкиВремениНапоминания</name>
    <type>
      <types>EnumRef.СпособыУстановкиВремениНапоминания</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалВремениНапоминания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяРеквизитаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникВерсияДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеИсточника</name>
    <comment>Представление источника</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатусНапоминания</name>
    <type>
      <types>EnumRef.AzRyСтатусНапоминания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/AzRyСтатусНапоминания/AzRyСтатусНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyСтатусНапоминания</name>
  <enumValues>
    <name>ОжидаетПодтверждения</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеНеОдобрено</name>
  </enumValues>
  <enumValues>
    <name>Finnished</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезПроекта</name>
      <description>პროექტის გარეშე</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRy_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyТипыПроектов</name>
    <type>
      <types>EnumRef.AzRyТипыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraProject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаправленияДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectType</name>
    <type>
      <types>EnumRef.AzRyTempoObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRytmpТаблицаКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/CommonModules/AzRyDEV/Module.bsl
Функция ДанныеЗапроса(Запрос, ИмяТаблицы) Экспорт
	
	ДанныеТаблицы = Новый Запрос;
	ДанныеТаблицы.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ДанныеТаблицы.Текст =
	"Выбрать *
	|    Из "+ИмяТаблицы+"
	|";
	
	Возврат ДанныеТаблицы.Выполнить().Выгрузить();
	
КонецФункции

Процедура AzRyЗапретРедактированияДокументовПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.AzRyЗапретРедактированияДокументов И Не ПараметрыСеанса.AzRyОтключитьЗапретРедактированияДокументов Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Текущий документ заблокированн!'; ka = 'მოცემული დოკუმენტი გადმოტანილია ძველი ბაზიდან და დაბლოკილია ცვლილებებზე!'; en = 'Current Document Blocked!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник.Ссылка,ТекстСообщения, , , ,Отказ);		
	КонецЕсли;	
	
КонецПроцедуры

Процедура AzRyЗапретНаУдалениеПриЗаписи(Источник, Отказ) Экспорт
	
	Если РольДоступна("AzRyЗапретНаУдаление") И Источник.ПометкаУдаления Тогда
		Отказ = Истина;
		Сообщить("თქვენს მომხმარებელს გათიშული აქვს წაშლის უფლება!");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодпискаНаСобытиеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	Если СтруктураВременныеТаблицы.Свойство("AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение") И СтруктураВременныеТаблицы.AzRy_НапПольз_ДвиженияЗапасыНаСкладахИзменение Тогда
		
		Текст1 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის (გატარება/მოხსნა) საწყობის პასუხისმგებლის გარეშე  დაბლოკილია. საწყობის პასუხისმგებელი პირი - '";
		Текст2 = "საწყობის პასუხისმგებლის კონტროლი: დოკუმენტის  (გატარება/მოხსნა) უნდა მოახდინოს შეტყობინების მიმღებმა. შეტყობინების მიმღები პირი  - '";
		
		Для каждого ТекущийОтветственный Из СтруктураВременныеТаблицы.AzRy_НапПольз_МассивТекущийОтветственный Цикл
			
			Если ТекущийОтветственный = Пользователи.ТекущийПользователь() Тогда // თუ საწყობის პასუხისმგებელი პირი ატარებს დოკუმენტს შემოწმება საჭირო აღარ არის.
				
				Продолжить;
						
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Неопределено 
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ОжидаетПодтверждения
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеНеОдобрено
				Или СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.Finnished Тогда
				
				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст1 + ТекущийОтветственный + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель <> Пользователи.ТекущийПользователь() Тогда				

				Отказ = Истина;
				УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(Источник, Текст2 + СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель + "' ",,,, Истина);				
				
			ИначеЕсли СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) <> Неопределено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный) = Перечисления.AzRyСтатусНапоминания.ПодтверждениеОдобрено
				И СтруктураВременныеТаблицы.AzRy_НапПольз_Получатель = Пользователи.ТекущийПользователь() Тогда

				СтатусНапоминания = СтруктураВременныеТаблицы.AzRy_НапПольз_КешСтатусНапоминания.Получить(ТекущийОтветственный);
				РегистрыСведений.AzRyНапоминанияПользователя.ОбновитьЗаписьПослеПроведенияДокумента(СтатусНапоминания, Источник.Ссылка); 

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//СтруктураВременныеТаблицы = Источник.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;	
	//Если Не СтруктураВременныеТаблицы.Свойство("AzRyДвиженияЗапасыИзменение") Или Отказ Или Не СтруктураВременныеТаблицы.AzRyДвиженияЗапасыИзменение Или СтруктураВременныеТаблицы.AzRyАвторДокумента = СтруктураВременныеТаблицы.AzRyОтветственныйЗаСклад Тогда
	//	Возврат;	
	//КонецЕсли; 
	//
	//// ვიძახებთ დამუშავებას და ვაგზავნით მეილს	                     
	//ОтправитьПисьмоОтветственногоЗаСкладом(СтруктураВременныеТаблицы.AzRyРегистратор, Пользователи.ТекущийПользователь());
	
КонецПроцедуры

Функция ПолучитьСтруктуруПроектаДокумента(Ссылка) Экспорт

	Ответ = ПроектДокумента(Ссылка);
	Если Ответ = Неопределено Тогда
		Возврат "{}";
	Иначе 	
		Возврат Новый Структура("ID, Key, Type, Name", Ответ.AzRyTempoObjectID, Ответ.AzRyTempoObjectKey, Строка(Ответ.AzRyTempoObjectType), Ответ.AzRyTempoObjectName);
	КонецЕсли; 

КонецФункции

// Основная функция - возвращает проект документа
Функция ПроектДокумента(Ссылка) Экспорт
	
	Проекты = ПроектыДокумента(Ссылка);
	
	Если Проекты = Неопределено ИЛИ Проекты.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если найдено несколько разных проектов - это может быть ошибкой
	Если Проекты.Количество() > 1 И Константы.AzRyОстанавливатьОбменПриНесколькихПроектахВДокументе.Получить() Тогда
		// Можно добавить логирование или вызов исключения
		Сообщение = НСтр(
		"ru='В документе найдено несколько проектов!';" +
		"en='Multiple projects were found in the document!';" +
		"ka='დოკუმენტში აღმოჩენილია რამდენიმე პროექტი!'"
		);			
		ВызватьИсключение(Сообщение); 
	КонецЕсли;
	
	Возврат Проекты[0].Проект;
	
КонецФункции

// Возвращает таблицу значений со всеми уникальными проектами документа
Функция ПроектыДокумента(Ссылка) Экспорт
	
	ТекстЗапроса = ПостроитьЗапросПроектов(Ссылка);
	
	Если ТекстЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Проект КАК Проект
	| ИЗ
	|	(" + ТекстЗапроса + ") КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Попытка
		РезультатЗапроса = Запрос.Выполнить();
	Исключение
		// Логирование ошибки выполнения запроса
		ТекстОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(
			"ПроектДокумента.Ошибка",
			УровеньЖурналаРегистрации.Ошибка,
			,
			Ссылка,
			"Ошибка получения проектов документа: " + ТекстОшибки
		);
		Возврат Неопределено;
	КонецПопытки;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Построение текста запроса для поиска проектов в табличных частях
Функция ПостроитьЗапросПроектов(Ссылка)
	
	// Проверка входящего параметра
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МетаданныеДокумента = Ссылка.Метаданные();
	ДокументИмя = МетаданныеДокумента.Имя;
	
	МассивЗапросов = Новый Массив;
	
	// Формирование запроса по всем табличным частям с реквизитом "Проект"
	Для каждого ТабличнаяЧасть Из МетаданныеДокумента.ТабличныеЧасти Цикл
		
		Если НЕ СодержитРеквизитПроект(ТабличнаяЧасть) Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстПодзапроса = "
		| ВЫБРАТЬ
		|	ТабЧасть.Проект КАК Проект
		| ИЗ
		|	Документ." + ДокументИмя + "." + ТабличнаяЧасть.Имя + " КАК ТабЧасть
		| ГДЕ
		|	ТабЧасть.Ссылка = &Ссылка
		|	И ТабЧасть.Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)";
		
		МассивЗапросов.Добавить(ТекстПодзапроса);
		
	КонецЦикла;
	
	// Если не найдено ни одной подходящей табличной части
	Если МассивЗапросов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Объединение всех подзапросов
	Возврат СтрСоединить(МассивЗапросов, "
	| ОБЪЕДИНИТЬ ВСЕ
	|");
	
КонецФункции

// Проверка наличия реквизита "Проект" в табличной части
Функция СодержитРеквизитПроект(ТабличнаяЧасть)
	
	Возврат (ТабличнаяЧасть.Реквизиты.Найти("Проект") <> Неопределено);
	
КонецФункции

// Альтернативный вариант: проверка через объект документа (без запросов)
Функция ПроектДокументаБезЗапроса(Ссылка) Экспорт
	
	Если Ссылка = Неопределено ИЛИ Ссылка.Пустая() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументОбъект = Ссылка.ПолучитьОбъект();
	
	Если ДокументОбъект = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МножествоПроектов = Новый Массив;
	
	Для каждого ТабличнаяЧасть Из Ссылка.Метаданные().ТабличныеЧасти Цикл
		
		Если НЕ СодержитРеквизитПроект(ТабличнаяЧасть) Тогда
			Продолжить;
		КонецЕсли;
		
		КоллекцияСтрок = ДокументОбъект[ТабличнаяЧасть.Имя];
		
		Для каждого Строка Из КоллекцияСтрок Цикл
			
			Если НЕ Строка.Проект.Пустая() И МножествоПроектов.Найти(Строка.Проект) = Неопределено Тогда
				МножествоПроектов.Добавить(Строка.Проект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если МножествоПроектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МножествоПроектов[0];
	
КонецФункции
